using System;
using System.Collections.Generic;
using System.ComponentModel.DataAnnotations;

namespace ProgramingLessons
{
    internal class Program
    {
        // Entry point
        static void Main(string[] args)
        {

            /*1) შეყვანა, კონვერტირება და გამოტანა (ბაზა)

            დავალება 1 — სახელი და ასაკი

            კონსოლიდან შეიყვანე Name (სტრინგი) და Age (რიცხვი).

            Age გადააკეთე int-ად.

            დაბეჭდე: გამარჯობა, <Name>. შენ ხარ <Age> წლის.

            დავალება 2 — სიმაღლე და წონა

            შეიყვანე Height (მეტრებში) და Weight (კგ).

            ორივე გადააკეთე double-ად.

            დაბეჭდე შეყვანილი მნიშვნელობები 2 ათწილადით.

            დავალება 3 — თარიღი

            შეიყვანე დაბადების თარიღი ტექსტად (მაგ: 2001-05-14).

            გამოიტანე უბრალოთ

            2) ორი მონაცემი და მათემატიკური ოპერაციები

            დავალება 4 — 2 რიცხვი: ჯამი/სხვაობა/გამრავლება/გაყოფა

            შეიყვანე a და b (int ან double).

            დაბეჭდე:

            a + b

            a - b

            a * b

            a / b (გაყოფისას გაითვალისწინე b != 0)

            დავალება 5 — საშუალო არითმეტიკული

            შეიყვანე ორი რიცხვი.

            დაბეჭდე მათი საშუალო: (a + b) / 2.

            დავალება 6 — ხარისხი და ნაშთი

            შეიყვანე ორი მთელი რიცხვი a და b.

            დაბეჭდე:

            a-ს b ხარისხი (Power)

            a % b (ნაშთი) — ყურადღება b != 0.*/
        }
    }
}

